ArchLinux/emacs/config.org

#+TITLE: GNU/EMACS
#+PROPERTY: header-args:emacs-lisp :tangle yes

* Basic UI & Dark Mode

Disable noisy UI elements:

#+BEGIN_SRC emacs-lisp
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(setq inhibit-startup-screen t)
#+END_SRC

**Dark theme** (highly recommended options):

Choose one of these (all excellent in 2026):

**Option A: Modus Vivendi** (built-in, high contrast, very accessible)

#+BEGIN_SRC emacs-lisp
(use-package modus-themes
  :ensure t
  :config
  (setq modus-themes-mode-line '(accented borderless)
        modus-themes-region '(bg-only)
        modus-themes-org-blocks 'gray-background)
  (load-theme 'modus-vivendi t))   ; dark theme
#+END_SRC

**Option B: Doom themes** (very popular, modern look — many love `doom-one`)

#+BEGIN_SRC emacs-lisp
(use-package doom-themes
  :ensure t
  :config
  (load-theme 'doom-one t)          ; or doom-dracula, doom-nord, doom-solarized-dark, etc.
  (doom-themes-visual-bell-config))
#+END_SRC

**Option C: Ef themes** (also by the same author as Modus — lighter but still great dark variants)

```elisp
(use-package ef-themes
  :ensure t
  :config
  (load-theme 'ef-dark t))
